app/controllers/products_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "Picture"], ["description", "nice picture"], ["updated_at", "2018-04-24 21:55:15.505033"], ["id", 1]]
---
  def update
    @product = Product.find(params[:id])
    @product.name = params[:product][:name]
    @product.description = params[:product][:description]
    @product.price = params[:product][:price]

    if @product.save

INSERT INTO "products" ("user_id", "name", "description", "price", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @product = Product.new
    @product.name = params[:product][:name]
    @product.description = params[:product][:description]
    @product.price = params[:product][:price]
    @product.url = params[:product][:url]
    @product.user_id = current_user.id
    if @product.save