app/controllers/reviews_controller.rb

  def create
  @review = Review.new
  @review.description = params[:review][:description]
  @review.product_id = params[:product_id]
  @review.user_id=current_user.id
  @review.save
---
INSERT INTO "reviews" ("user_id", "product_id", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", "2"], ["product_id", "1"], ["description", "qweqwe"], ["created_at", "2018-04-24 22:04:39.956985"], ["updated_at", "2018-04-24 22:04:39.956985"]]

  def edit
    @review = Review.find(params[:id])
    @product = Product.find(params[:product_id])
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @review = Review.find(params[:id])
    @review.description = params[:review][:description]
    @review.product_id = params[:product_id]
    @review.save
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "reviews" SET "description" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["description", "goooood review"], ["updated_at", "2018-04-24 22:26:04.343132"], ["id", 3]]

  def destroy
    @product = Product.find(params[:product_id])
    @review = Review.find(params[:id])
    @review.destroy
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 1]]