app/views/products/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" = ?  [["product_id", "1"]]
---
  <h2 class="label">Reviews:</h2>
  <% @product.reviews.each do |review| %>